<a href="https://colab.research.google.com/github/kyt50207/StudyML/blob/main/DEEP_LEARNING_DAY1%EC%9D%98_%EC%82%AC%EB%B3%B8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
titles = pd.read_csv("/content/sample_data/titles.csv",error_bad_lines=False)

b'Skipping line 170399: expected 2 fields, saw 3\n'

In [ ]:
titles

                          title    year
0                The Rising Son  1990.0
1             Ashes of Kukulcan  2016.0
2       The Thousand Plane Raid  1969.0
3              Crucea de piatra  1993.0
4                        The 86  2015.0
...                         ...     ...
295335           Le mouton noir  1922.0
295336      Edge of the Unknown  2015.0
295337                    E yue  2005.0
295338             Lakota Girls  2015.0
295339             The Sting II  1983.0

[295340 rows x 2 columns]

In [ ]:
len(titles)

295340

In [ ]:
titles.sort_values('year')

                                                    title    year
74193                                          Miss Jerry  1894.0
244541                                         Miss Jerry  1894.0
131159  Reproduction of the Corbett and Fitzsimmons Fight  1897.0
152771        Sharkey-McCoy Fight Reproduced in 10 Rounds  1899.0
195262     Reproduction of the Corbett and Jeffries Fight  1899.0
...                                                   ...     ...
264727                                  The Tree of Death  2022.0
279149                                     New in Village  2024.0
44198                                           Wild Runs  2024.0
154207                                     New in Village  2024.0
45631                                       Gui mian 2015     NaN

[295340 rows x 2 columns]

In [ ]:
is_hamlet = titles['title'] == 'Hamlet'
hamlet = titles[is_hamlet]
hamlet

         title    year
5562    Hamlet  1948.0
26160   Hamlet  2016.0
37373   Hamlet  2015.0
42224   Hamlet  1990.0
43511   Hamlet  1910.0
63638   Hamlet  1913.0
72656   Hamlet  2009.0
79007   Hamlet  1964.0
113690  Hamlet  1954.0
131192  Hamlet  1976.0
133232  Hamlet  1987.0
133422  Hamlet  2000.0
141405  Hamlet  1996.0
147232  Hamlet  2011.0
149432  Hamlet  1911.0
160238  Hamlet  1973.0
162210  Hamlet  2014.0
171069  Hamlet  1921.0
193583  Hamlet  1969.0
233986  Hamlet  1913.0
243004  Hamlet  2009.0
249355  Hamlet  1964.0
266347  Hamlet  1996.0
272174  Hamlet  2011.0
274374  Hamlet  1911.0
285180  Hamlet  1973.0
287152  Hamlet  2014.0

In [ ]:
is_TreasureIsland = titles['title'] == 'Treasure Island'
TreasureIsland = titles[is_TreasureIsland]
TreasureIsland = TreasureIsland.sort_values('year',ascending=True)
TreasureIsland

                  title    year
145796  Treasure Island  1918.0
270738  Treasure Island  1918.0
93220   Treasure Island  1920.0
147334  Treasure Island  1934.0
272276  Treasure Island  1934.0
135626  Treasure Island  1950.0
184073  Treasure Island  1972.0
183005  Treasure Island  1973.0
145209  Treasure Island  1985.0
270151  Treasure Island  1985.0
75686   Treasure Island  1999.0
246034  Treasure Island  1999.0

In [ ]:
is_50s = titles['year'] >= 1950
is_50a = titles['year'] <= 1959
subset_df = titles[is_50a & is_50s]
len(subset_df)

16424

In [ ]:
# #pd 기본          (암기 필수!)
# -pd.head()
# -pd.shape
# -pd.columns
# -pd.info
# -pd.tail()
# -pd.describe_option
# -pd.isnull().sum()

In [ ]:
#@title 싸이키런의 앙상블에서 랜덤포레스트 클래스파이어 사용해보기


from sklearn.ensemble import RandomForestClassifier

In [ ]:
clf = RandomForestClassifier(random_state=123) #1. 클래스 선언
X = [[ 1,  2,  3],  
     [11, 12, 13],
     [23,33,45]] #2samples , 3 features 독립변수 입력값.
y = [0, 1,0]    # classes of each sample#종속변수 레이블

In [ ]:
clf.fit(X, y) #2.fit라는 알고리즘으로 학습시키기

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=None, max_features='auto',
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=100,
                       n_jobs=None, oob_score=False, random_state=123,
                       verbose=0, warm_start=False)

In [ ]:
clf.predict(X)  #3. predict하기

array([0, 1, 0])

In [ ]:
clf.predict([[234,23,456],[25,685,76]])    #다른 값으로 예측해보기

array([0, 0])

In [ ]:
import numpy as np

In [ ]:
rs = np.random.RandomState(10) #괄호안의 숫자가 중요함
x=10*rs.rand(5)
y=2*x -1*rs.rand(5)
x.shape, y.shape

((5,), (5,))

In [ ]:
X = x.reshape(3,3)
X.shape

ValueError: ignored